; NOTE: Assertions have been autogenerated by utils/update_test_checks.py
; RUN: opt %s --passes=gvn -o - -S | FileCheck %s
; We should copy leading dbg.values ahead of instructions, when blockSplicing
; and merging the two predecessors in MergeBlockIntoPredecessor
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

define internal fastcc void @_ZL5getUsIhEPT_PjS1_jPKN4llvm13DataExtractorEbPKc() {
; CHECK-LABEL: @_ZL5getUsIhEPT_PjS1_jPKN4llvm13DataExtractorEbPKc(
; CHECK-NEXT:  entry:
; CHECK-NEXT:    call void @llvm.dbg.value(metadata i32 undef, metadata [[META1348:![0-9]+]], metadata !DIExpression()), !dbg [[DBG1372:![0-9]+]]
; CHECK-NEXT:    store i32 0, ptr null, align 4
; CHECK-NEXT:    ret void
;
entry:
  br label %for.end

for.end:                                          ; preds = %entry
  call void @llvm.dbg.value(metadata i32 undef, metadata !1348, metadata !DIExpression()), !dbg !1372
  store i32 0, ptr null, align 4
  ret void
}

; Function Attrs: nocallback nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.value(metadata, metadata, metadata) #0

attributes #0 = { nocallback nofree nosync nounwind readnone speculatable willreturn }

!llvm.dbg.cu = !{!0}
!llvm.module.flags = !{!1343, !1344, !1345, !1346, !1347}


!452 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !451)
!453 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !318)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !455, file: !428, line: 81)
!455 = !DISubprogram(name: "strcmp", scope: !420, file: !420, line: 136, type: !456, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!456 = !DISubroutineType(types: !457)
!457 = !{!13, !318, !318}
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !459, file: !428, line: 82)
!459 = !DISubprogram(name: "strcoll", scope: !420, file: !420, line: 143, type: !456, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !461, file: !428, line: 83)
!461 = !DISubprogram(name: "strcpy", scope: !420, file: !420, line: 121, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !463, file: !428, line: 84)
!463 = !DISubprogram(name: "strcspn", scope: !420, file: !420, line: 272, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!464 = !DISubroutineType(types: !465)
!465 = !{!426, !318, !318}
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !467, file: !428, line: 85)
!467 = !DISubprogram(name: "strerror", scope: !420, file: !420, line: 396, type: !468, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!468 = !DISubroutineType(types: !469)
!469 = !{!451, !13}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !471, file: !428, line: 86)
!471 = !DISubprogram(name: "strlen", scope: !420, file: !420, line: 384, type: !472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{!426, !318}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !475, file: !428, line: 87)
!475 = !DISubprogram(name: "strncat", scope: !420, file: !420, line: 132, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!476 = !DISubroutineType(types: !477)
!477 = !{!451, !452, !453, !426}
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !479, file: !428, line: 88)
!479 = !DISubprogram(name: "strncmp", scope: !420, file: !420, line: 139, type: !480, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DISubroutineType(types: !481)
!481 = !{!13, !318, !318, !426}
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !483, file: !428, line: 89)
!483 = !DISubprogram(name: "strncpy", scope: !420, file: !420, line: 124, type: !476, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !485, file: !428, line: 90)
!485 = !DISubprogram(name: "strspn", scope: !420, file: !420, line: 276, type: !464, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !487, file: !428, line: 91)
!487 = !DISubprogram(name: "strtok", scope: !420, file: !420, line: 335, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !489, file: !428, line: 92)
!489 = !DISubprogram(name: "strxfrm", scope: !420, file: !420, line: 146, type: !490, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!490 = !DISubroutineType(types: !491)
!491 = !{!426, !452, !453, !426}
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !493, file: !428, line: 93)
!493 = !DISubprogram(name: "strchr", scope: !420, file: !420, line: 225, type: !494, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!494 = !DISubroutineType(types: !495)
!495 = !{!451, !318, !13}
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !497, file: !428, line: 94)
!497 = !DISubprogram(name: "strpbrk", scope: !420, file: !420, line: 302, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubroutineType(types: !499)
!499 = !{!451, !318, !318}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !501, file: !428, line: 95)
!501 = !DISubprogram(name: "strrchr", scope: !420, file: !420, line: 252, type: !494, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !503, file: !428, line: 96)
!503 = !DISubprogram(name: "strstr", scope: !420, file: !420, line: 329, type: !498, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !505, entity: !506, file: !507, line: 58)
!505 = !DINamespace(name: "__gnu_debug", scope: null)
!506 = !DINamespace(name: "__debug", scope: !71)
!507 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/8/../../../../include/c++/8/debug/debug.h", directory: "", checksumkind: CSK_MD5, checksum: "0d648599b52b1d377b1fee4a0a4b2b91")
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !509, file: !511, line: 127)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !73, line: 62, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 58, size: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!511 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/8/../../../../include/c++/8/cstdlib", directory: "")
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !513, file: !511, line: 128)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !73, line: 70, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !515, identifier: "_ZTS6ldiv_t")
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !514, file: !73, line: 68, baseType: !16, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !514, file: !73, line: 69, baseType: !16, size: 64, offset: 64)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !519, file: !511, line: 130)
!519 = !DISubprogram(name: "abort", scope: !73, file: !73, line: 588, type: !520, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !523, file: !511, line: 134)
!523 = !DISubprogram(name: "atexit", scope: !73, file: !73, line: 592, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!13, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !528, file: !511, line: 137)
!528 = !DISubprogram(name: "at_quick_exit", scope: !73, file: !73, line: 597, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !530, file: !511, line: 140)
!530 = !DISubprogram(name: "atof", scope: !531, file: !531, line: 25, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "", checksumkind: CSK_MD5, checksum: "ce60958b260b171e83db3307f1d644f0")
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !533, file: !511, line: 141)
!533 = !DISubprogram(name: "atoi", scope: !73, file: !73, line: 361, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!13, !318}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !537, file: !511, line: 142)
!537 = !DISubprogram(name: "atol", scope: !73, file: !73, line: 366, type: !538, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DISubroutineType(types: !539)
!539 = !{!16, !318}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !541, file: !511, line: 143)
!541 = !DISubprogram(name: "bsearch", scope: !542, file: !542, line: 20, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "", checksumkind: CSK_MD5, checksum: "1a798a38b25adee7bb680abce9ef568a")
!543 = !DISubroutineType(types: !544)
!544 = !{!423, !424, !424, !426, !426, !545}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !73, line: 805, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!13, !424, !424}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !550, file: !511, line: 144)
!550 = !DISubprogram(name: "calloc", scope: !73, file: !73, line: 541, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{!423, !426, !426}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !554, file: !511, line: 145)
!554 = !DISubprogram(name: "div", scope: !73, file: !73, line: 849, type: !555, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!555 = !DISubroutineType(types: !556)
!556 = !{!509, !13, !13}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !558, file: !511, line: 146)
!558 = !DISubprogram(name: "exit", scope: !73, file: !73, line: 614, type: !559, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !13}
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !562, file: !511, line: 147)
!562 = !DISubprogram(name: "free", scope: !73, file: !73, line: 563, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !423}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !566, file: !511, line: 148)
!566 = !DISubprogram(name: "getenv", scope: !73, file: !73, line: 631, type: !567, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DISubroutineType(types: !568)
!568 = !{!451, !318}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !570, file: !511, line: 149)
!570 = !DISubprogram(name: "labs", scope: !73, file: !73, line: 838, type: !571, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!571 = !DISubroutineType(types: !572)
!572 = !{!16, !16}
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !574, file: !511, line: 150)
!574 = !DISubprogram(name: "ldiv", scope: !73, file: !73, line: 851, type: !575, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!575 = !DISubroutineType(types: !576)
!576 = !{!513, !16, !16}
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !578, file: !511, line: 151)
!578 = !DISubprogram(name: "malloc", scope: !73, file: !73, line: 539, type: !579, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!579 = !DISubroutineType(types: !580)
!580 = !{!423, !426}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !582, file: !511, line: 153)
!582 = !DISubprogram(name: "mblen", scope: !73, file: !73, line: 919, type: !583, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubroutineType(types: !584)
!584 = !{!13, !318, !426}
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !586, file: !511, line: 154)
!586 = !DISubprogram(name: "mbstowcs", scope: !73, file: !73, line: 930, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!587 = !DISubroutineType(types: !588)
!588 = !{!426, !589, !453, !426}
!589 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !593, file: !511, line: 155)
!593 = !DISubprogram(name: "mbtowc", scope: !73, file: !73, line: 922, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{!13, !589, !453, !426}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !597, file: !511, line: 157)
!597 = !DISubprogram(name: "qsort", scope: !73, file: !73, line: 827, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !423, !426, !426, !545}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !601, file: !511, line: 160)
!601 = !DISubprogram(name: "quick_exit", scope: !73, file: !73, line: 620, type: !559, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !603, file: !511, line: 163)
!603 = !DISubprogram(name: "rand", scope: !73, file: !73, line: 453, type: !604, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DISubroutineType(types: !605)
!605 = !{!13}
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !607, file: !511, line: 164)
!607 = !DISubprogram(name: "realloc", scope: !73, file: !73, line: 549, type: !608, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{!423, !423, !426}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !611, file: !511, line: 165)
!611 = !DISubprogram(name: "srand", scope: !73, file: !73, line: 455, type: !612, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !614}
!614 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !616, file: !511, line: 166)
!616 = !DISubprogram(name: "strtod", scope: !73, file: !73, line: 117, type: !617, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DISubroutineType(types: !618)
!618 = !{!82, !453, !619}
!619 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !622, file: !511, line: 167)
!622 = !DISubprogram(name: "strtol", scope: !73, file: !73, line: 176, type: !623, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!623 = !DISubroutineType(types: !624)
!624 = !{!16, !453, !619, !13}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !626, file: !511, line: 168)
!626 = !DISubprogram(name: "strtoul", scope: !73, file: !73, line: 180, type: !627, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!627 = !DISubroutineType(types: !628)
!628 = !{!20, !453, !619, !13}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !630, file: !511, line: 169)
!630 = !DISubprogram(name: "system", scope: !73, file: !73, line: 781, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !632, file: !511, line: 171)
!632 = !DISubprogram(name: "wcstombs", scope: !73, file: !73, line: 933, type: !633, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!633 = !DISubroutineType(types: !634)
!634 = !{!426, !452, !635, !426}
!635 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !639, file: !511, line: 172)
!639 = !DISubprogram(name: "wctomb", scope: !73, file: !73, line: 926, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!640 = !DISubroutineType(types: !641)
!641 = !{!13, !451, !591}
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !644, file: !511, line: 200)
!643 = !DINamespace(name: "__gnu_cxx", scope: null)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !73, line: 80, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !646, identifier: "_ZTS7lldiv_t")
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !645, file: !73, line: 78, baseType: !263, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !645, file: !73, line: 79, baseType: !263, size: 64, offset: 64)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !650, file: !511, line: 206)
!650 = !DISubprogram(name: "_Exit", scope: !73, file: !73, line: 626, type: !559, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !652, file: !511, line: 210)
!652 = !DISubprogram(name: "llabs", scope: !73, file: !73, line: 841, type: !653, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DISubroutineType(types: !654)
!654 = !{!263, !263}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !656, file: !511, line: 216)
!656 = !DISubprogram(name: "lldiv", scope: !73, file: !73, line: 855, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!657 = !DISubroutineType(types: !658)
!658 = !{!644, !263, !263}
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !660, file: !511, line: 227)
!660 = !DISubprogram(name: "atoll", scope: !73, file: !73, line: 373, type: !661, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!661 = !DISubroutineType(types: !662)
!662 = !{!263, !318}
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !664, file: !511, line: 228)
!664 = !DISubprogram(name: "strtoll", scope: !73, file: !73, line: 200, type: !665, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!665 = !DISubroutineType(types: !666)
!666 = !{!263, !453, !619, !13}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !668, file: !511, line: 229)
!668 = !DISubprogram(name: "strtoull", scope: !73, file: !73, line: 205, type: !669, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !453, !619, !13}
!671 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !673, file: !511, line: 231)
!673 = !DISubprogram(name: "strtof", scope: !73, file: !73, line: 123, type: !674, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!674 = !DISubroutineType(types: !675)
!675 = !{!141, !453, !619}
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !643, entity: !677, file: !511, line: 232)
!677 = !DISubprogram(name: "strtold", scope: !73, file: !73, line: 126, type: !678, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!678 = !DISubroutineType(types: !679)
!679 = !{!152, !453, !619}
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !644, file: !511, line: 240)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !650, file: !511, line: 242)
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !652, file: !511, line: 244)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !684, file: !511, line: 245)
!684 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !643, file: !511, line: 213, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !656, file: !511, line: 246)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !660, file: !511, line: 248)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !673, file: !511, line: 249)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !664, file: !511, line: 250)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !668, file: !511, line: 251)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !677, file: !511, line: 252)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !692, file: !693, line: 57)
!692 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !694, file: !693, line: 79, size: 64, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!693 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/8/../../../../include/c++/8/bits/exception_ptr.h", directory: "", checksumkind: CSK_MD5, checksum: "25d44782b686509a9fc5c8aaa8066643")
!694 = !DINamespace(name: "__exception_ptr", scope: !71)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !694, entity: !696, file: !693, line: 73)
!696 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !71, file: !693, line: 69, type: !697, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !692}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !700, file: !715, line: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !701, line: 6, baseType: !702)
!701 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "ba8742313715e20e434cf6ccb2db98e3")
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !703, line: 21, baseType: !704)
!703 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "", checksumkind: CSK_MD5, checksum: "82911a3e689448e3691ded3e0b471a55")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !705, identifier: "_ZTS11__mbstate_t")
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !704, file: !703, line: 15, baseType: !13, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !704, file: !703, line: 20, baseType: !708, size: 32, offset: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !704, file: !703, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !709, identifier: "_ZTSN11__mbstate_tUt_E")
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !708, file: !703, line: 18, baseType: !614, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !708, file: !703, line: 19, baseType: !712, size: 32)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 4)
!715 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/8/../../../../include/c++/8/cwchar", directory: "")
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !717, file: !715, line: 139)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !718, line: 20, baseType: !614)
!718 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "", checksumkind: CSK_MD5, checksum: "aa31b53ef28dc23152ceb41e2763ded3")
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !720, file: !715, line: 141)
!720 = !DISubprogram(name: "btowc", scope: !721, file: !721, line: 318, type: !722, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DIFile(filename: "/usr/include/wchar.h", directory: "", checksumkind: CSK_MD5, checksum: "5c0512b032e303d7adfb2a47454ecb1c")
!722 = !DISubroutineType(types: !723)
!723 = !{!717, !13}
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !725, file: !715, line: 142)
!725 = !DISubprogram(name: "fgetwc", scope: !721, file: !721, line: 727, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DISubroutineType(types: !727)
!727 = !{!717, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !730, line: 5, baseType: !731)
!730 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "72a8fe90981f484acae7c6f3dfc5c2b7")
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !732, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !733, identifier: "_ZTS8_IO_FILE")
!732 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "", checksumkind: CSK_MD5, checksum: "e2b53e448ab24b9cd2ba8684267b8131")
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !749, !751, !752, !753, !755, !757, !758, !762, !765, !767, !768, !769, !770, !771, !772, !773}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !731, file: !732, line: 246, baseType: !13, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !731, file: !732, line: 251, baseType: !451, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !731, file: !732, line: 252, baseType: !451, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !731, file: !732, line: 253, baseType: !451, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !731, file: !732, line: 254, baseType: !451, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !731, file: !732, line: 255, baseType: !451, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !731, file: !732, line: 256, baseType: !451, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !731, file: !732, line: 257, baseType: !451, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !731, file: !732, line: 258, baseType: !451, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !731, file: !732, line: 260, baseType: !451, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !731, file: !732, line: 261, baseType: !451, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !731, file: !732, line: 262, baseType: !451, size: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !731, file: !732, line: 264, baseType: !747, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !732, line: 160, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !731, file: !732, line: 266, baseType: !750, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !731, file: !732, line: 268, baseType: !13, size: 32, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !731, file: !732, line: 272, baseType: !13, size: 32, offset: 928)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !731, file: !732, line: 274, baseType: !754, size: 64, offset: 960)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !6, line: 140, baseType: !16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !731, file: !732, line: 278, baseType: !756, size: 16, offset: 1024)
!756 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !731, file: !732, line: 279, baseType: !7, size: 8, offset: 1040)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !731, file: !732, line: 280, baseType: !759, size: 8, offset: 1048)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 1)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !731, file: !732, line: 284, baseType: !763, size: 64, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !732, line: 154, baseType: null)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !731, file: !732, line: 293, baseType: !766, size: 64, offset: 1152)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !6, line: 141, baseType: !16)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !731, file: !732, line: 301, baseType: !423, size: 64, offset: 1216)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !731, file: !732, line: 302, baseType: !423, size: 64, offset: 1280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !731, file: !732, line: 303, baseType: !423, size: 64, offset: 1344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !731, file: !732, line: 304, baseType: !423, size: 64, offset: 1408)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !731, file: !732, line: 306, baseType: !426, size: 64, offset: 1472)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !731, file: !732, line: 307, baseType: !13, size: 32, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !731, file: !732, line: 309, baseType: !774, size: 160, offset: 1568)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 20)
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !778, file: !715, line: 143)
!778 = !DISubprogram(name: "fgetws", scope: !721, file: !721, line: 756, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!779 = !DISubroutineType(types: !780)
!780 = !{!590, !589, !13, !781}
!781 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !728)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !783, file: !715, line: 144)
!783 = !DISubprogram(name: "fputwc", scope: !721, file: !721, line: 741, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!784 = !DISubroutineType(types: !785)
!785 = !{!717, !591, !728}
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !787, file: !715, line: 145)
!787 = !DISubprogram(name: "fputws", scope: !721, file: !721, line: 763, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!788 = !DISubroutineType(types: !789)
!789 = !{!13, !635, !781}
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !791, file: !715, line: 146)
!791 = !DISubprogram(name: "fwide", scope: !721, file: !721, line: 573, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!13, !728, !13}
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !795, file: !715, line: 147)
!795 = !DISubprogram(name: "fwprintf", scope: !721, file: !721, line: 580, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!13, !781, !635, null}
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !799, file: !715, line: 148)
!799 = !DISubprogram(name: "fwscanf", scope: !721, file: !721, line: 621, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !801, file: !715, line: 149)
!801 = !DISubprogram(name: "getwc", scope: !721, file: !721, line: 728, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !803, file: !715, line: 150)
!803 = !DISubprogram(name: "getwchar", scope: !721, file: !721, line: 734, type: !804, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!804 = !DISubroutineType(types: !805)
!805 = !{!717}
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !807, file: !715, line: 151)
!807 = !DISubprogram(name: "mbrlen", scope: !721, file: !721, line: 329, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!426, !453, !426, !810}
!810 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !813, file: !715, line: 152)
!813 = !DISubprogram(name: "mbrtowc", scope: !721, file: !721, line: 296, type: !814, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{!426, !589, !453, !426, !810}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !817, file: !715, line: 153)
!817 = !DISubprogram(name: "mbsinit", scope: !721, file: !721, line: 292, type: !818, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DISubroutineType(types: !819)
!819 = !{!13, !820}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !700)
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !823, file: !715, line: 154)
!823 = !DISubprogram(name: "mbsrtowcs", scope: !721, file: !721, line: 337, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubroutineType(types: !825)
!825 = !{!426, !589, !826, !426, !810}
!826 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!828 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !829, file: !715, line: 155)
!829 = !DISubprogram(name: "putwc", scope: !721, file: !721, line: 742, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !831, file: !715, line: 156)
!831 = !DISubprogram(name: "putwchar", scope: !721, file: !721, line: 748, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubroutineType(types: !833)
!833 = !{!717, !591}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !835, file: !715, line: 158)
!835 = !DISubprogram(name: "swprintf", scope: !721, file: !721, line: 590, type: !836, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubroutineType(types: !837)
!837 = !{!13, !589, !426, !635, null}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !839, file: !715, line: 160)
!839 = !DISubprogram(name: "swscanf", scope: !721, file: !721, line: 631, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !DISubroutineType(types: !841)
!841 = !{!13, !635, !635, null}
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !843, file: !715, line: 161)
!843 = !DISubprogram(name: "ungetwc", scope: !721, file: !721, line: 771, type: !844, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!844 = !DISubroutineType(types: !845)
!845 = !{!717, !717, !728}
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !847, file: !715, line: 162)
!847 = !DISubprogram(name: "vfwprintf", scope: !721, file: !721, line: 598, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubroutineType(types: !849)
!849 = !{!13, !781, !635, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !852, identifier: "_ZTS13__va_list_tag")
!852 = !{!853, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !851, file: !854, baseType: !614, size: 32)
!854 = !DIFile(filename: "llvm34/lib/Support/DataExtractor.cpp", directory: "/fast/fs")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !851, file: !854, baseType: !614, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !851, file: !854, baseType: !423, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !851, file: !854, baseType: !423, size: 64, offset: 128)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !859, file: !715, line: 164)
!859 = !DISubprogram(name: "vfwscanf", scope: !721, file: !721, line: 673, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !861, file: !715, line: 167)
!861 = !DISubprogram(name: "vswprintf", scope: !721, file: !721, line: 611, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!862 = !DISubroutineType(types: !863)
!863 = !{!13, !589, !426, !635, !850}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !865, file: !715, line: 170)
!865 = !DISubprogram(name: "vswscanf", scope: !721, file: !721, line: 685, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!866 = !DISubroutineType(types: !867)
!867 = !{!13, !635, !635, !850}
!868 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !869, file: !715, line: 172)
!869 = !DISubprogram(name: "vwprintf", scope: !721, file: !721, line: 606, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!870 = !DISubroutineType(types: !871)
!871 = !{!13, !635, !850}
!872 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !873, file: !715, line: 174)
!873 = !DISubprogram(name: "vwscanf", scope: !721, file: !721, line: 681, type: !870, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !875, file: !715, line: 176)
!875 = !DISubprogram(name: "wcrtomb", scope: !721, file: !721, line: 301, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!876 = !DISubroutineType(types: !877)
!877 = !{!426, !452, !591, !810}
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !879, file: !715, line: 177)
!879 = !DISubprogram(name: "wcscat", scope: !721, file: !721, line: 97, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!880 = !DISubroutineType(types: !881)
!881 = !{!590, !589, !635}
!882 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !883, file: !715, line: 178)
!883 = !DISubprogram(name: "wcscmp", scope: !721, file: !721, line: 106, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!884 = !DISubroutineType(types: !885)
!885 = !{!13, !636, !636}
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !887, file: !715, line: 179)
!887 = !DISubprogram(name: "wcscoll", scope: !721, file: !721, line: 131, type: !884, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !889, file: !715, line: 180)
!889 = !DISubprogram(name: "wcscpy", scope: !721, file: !721, line: 87, type: !880, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!890 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !891, file: !715, line: 181)
!891 = !DISubprogram(name: "wcscspn", scope: !721, file: !721, line: 187, type: !892, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!892 = !DISubroutineType(types: !893)
!893 = !{!426, !636, !636}
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !71, entity: !895, file: !715, line: 182)
!895 = !DISubprogram(name: "wcsftime", scope: !721, file: !721, line: 835, type: !896, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!896 = !DISubroutineType(types: !897)
!897 = !{!426, !589, !426, !635, !898}
!898 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !721, line: 83, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS2tm")
